In [50]:
import pandas as pd

import numpy as np

pds = pd.Series(['1', 2, 4, 'teste'])
pds.dtype

print(pds)

for valor in pds:
    print(valor, type(valor))

0        1
1        2
2        4
3    teste
dtype: object
1 <class 'str'>
2 <class 'int'>
4 <class 'int'>
teste <class 'str'>

In [51]:
dates = pd.date_range('20250801', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

df

df2 = pd.DataFrame(
    {
        "A": [-1, -2, 3, -4],
        "B": pd.Timestamp("20250825"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo"

    }
)

df2

   A          B    C  D      E    F
0 -1 2025-08-25  1.0  3   test  foo
1 -2 2025-08-25 -2.5 -5  train  bar
2  3 2025-08-25  3.3  7   test  baz
3 -4 2025-08-25 -4.1 -9  train  qux

In [52]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float64
D             int64
E          category
F            object
dtype: object

In [53]:
df2.A

0   -1
1   -2
2    3
3   -4
Name: A, dtype: int64

In [55]:
import pandas as pd
import numpy as np

df2 = pd.DataFrame({
    "A": [-1, -2, -3, -4],
    "B": pd.to_datetime("2025-08-25"),
    "C": [1.0, -2.0, 3.0, -4.0],
    "D": [3, -3, 5, -6],
    "E": pd.Categorical(["test", "train", "test", "train"]),
    "F": "foo"
})

print("Original:")
print(df2)

print("\nSomente colunas numéricas com abs():")
print(df2.select_dtypes(include=["number"]).abs())

Original:
   A          B    C  D      E    F
0 -1 2025-08-25  1.0  3   test  foo
1 -2 2025-08-25 -2.0 -3  train  foo
2 -3 2025-08-25  3.0  5   test  foo
3 -4 2025-08-25 -4.0 -6  train  foo

Somente colunas numéricas com abs():
   A    C  D
0  1  1.0  3
1  2  2.0  3
2  3  3.0  5
3  4  4.0  6

In [57]:
df2.describe()

              A                    B         C         D
count  4.000000                    4  4.000000  4.000000
mean  -2.500000  2025-08-25 00:00:00 -0.500000 -0.250000
min   -4.000000  2025-08-25 00:00:00 -4.000000 -6.000000
25%   -3.250000  2025-08-25 00:00:00 -2.500000 -3.750000
50%   -2.500000  2025-08-25 00:00:00 -0.500000  0.000000
75%   -1.750000  2025-08-25 00:00:00  1.500000  3.500000
max   -1.000000  2025-08-25 00:00:00  3.000000  5.000000
std    1.290994                  NaN  3.109126  5.123475

In [59]:
df2["A"]

0   -1
1   -2
2   -3
3   -4
Name: A, dtype: int64

In [61]:
df2[0:3]

   A          B    C  D      E    F
0 -1 2025-08-25  1.0  3   test  foo
1 -2 2025-08-25 -2.0 -3  train  foo
2 -3 2025-08-25  3.0  5   test  foo

In [67]:
df2 = df2.set_index("B")
df2["20250825":"20250825"]

            A    C  D      E    F
B
2025-08-25 -1  1.0  3   test  foo
2025-08-25 -2 -2.0 -3  train  foo
2025-08-25 -3  3.0  5   test  foo
2025-08-25 -4 -4.0 -6  train  foo

In [78]:
df2.loc[:, ["A", "C"]]

            A    C
B
2025-08-25 -1  1.0
2025-08-25 -2 -2.0
2025-08-25 -3  3.0
2025-08-25 -4 -4.0

In [ ]:
df2.iloc[0, 1]

1.0